# SweepProfile Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SweepProfile Class
Members See Also
---
Represents a profile for sweep or swept blend elements.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class SweepProfile : APIObject
```

Visual Basic
---
```text
Public Class SweepProfile _
	Inherits APIObject
```

Visual C++
---
```text
public ref class SweepProfile : public APIObject
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..SweepProfile Autodesk.Revit.DB..::..CurveLoopsProfile Autodesk.Revit.DB..::..FamilySymbolProfile
# See Also
SweepProfile Members
Autodesk.Revit.DB Namespace